nxp-mcuxpresso/mcux-soc-svd/KW45B41Z53/KW45B41Z53.xml
        <register>
          <name>MGPCR1</name>
          <description>Master General Purpose Control Register</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB_0</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_1</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_2</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_3</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_4</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR2</name>
          <description>Master General Purpose Control Register</description>
          <addressOffset>0xA00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB_0</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_1</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_2</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_3</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_4</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR3</name>
          <description>Master General Purpose Control Register</description>
          <addressOffset>0xB00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB_0</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_1</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_2</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_3</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_4</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR4</name>
          <description>Master General Purpose Control Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB_0</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_1</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_2</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_3</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_4</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR5</name>
          <description>Master General Purpose Control Register</description>
          <addressOffset>0xD00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB_0</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_1</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_2</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_3</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB_4</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
