nxp-mcuxpresso/mcux-soc-svd/KW45B41Z53/KW45B41Z53.xml
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Pin is configured for general-purpose input provided, the pin is configured for any digital function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Pin is disabled for general-purpose input.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID29</name>
              <description>Port Input Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Pin is configured for general-purpose input provided, the pin is configured for any digital function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Pin is disabled for general-purpose input.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID30</name>
              <description>Port Input Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Pin is configured for general-purpose input provided, the pin is configured for any digital function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Pin is disabled for general-purpose input.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID31</name>
              <description>Port Input Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Pin is configured for general-purpose input provided, the pin is configured for any digital function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Pin is disabled for general-purpose input.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PDR[%s]</name>
          <description>Pin Data Register a</description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PD</name>
              <description>Pin Data (input and output)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pd0</name>
                  <description>Pin logic level is logic zero or not configured for use by digital function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pd1</name>
                  <description>Pin logic level is logic one.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ICR[%s]</name>
          <description>Interrupt Control Register index</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>Interrupt Status Flag (ISF) is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF flag and DMA request on rising edge.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF flag and DMA request on falling edge.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF flag and DMA request on either edge.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF flag sets on rising edge.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF flag sets on falling edge.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF flag sets on either edge.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF flag and Interrupt when logic 0.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF flag and Interrupt on rising-edge.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF flag and Interrupt on falling-edge.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF flag and Interrupt on either edge.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF flag and Interrupt when logic 1.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active high trigger output, ISF flag on rising edge. Pin state is ORed with other enabled triggers to generate the output trigger, for use by other peripherals.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active low trigger output, ISF flag on falling edge. Pin state is inverted and ORed with other enabled triggers to generate the output trigger, for use by other peripherals.</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQS</name>
              <description>Interrupt Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqs0</name>
                  <description>Interrupt/trigger output/DMA request 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqs1</name>
                  <description>Interrupt/trigger output/DMA request 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lk0</name>
                  <description>Interrupt configuration by ICR[23:0] is not locked and can be updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lk1</name>
                  <description>Interrupt configuration by ICR[23:0] is locked and cannot be updated until next system reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Configured interrupt is not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
