nxp-mcuxpresso/mcux-soc-svd/KW45B41Z53/KW45B41Z53.xml
        <register>
          <name>FCTRL</name>
          <description>Flash Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>RWSC</name>
              <description>Read Wait-State Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSACTIVE</name>
              <description>Low speed active mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSACTIVE_0</name>
                  <description>Full speed active mode requested</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSACTIVE_1</name>
                  <description>Low speed active mode requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDFD</name>
              <description>Force Double Bit Fault Detect</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDFD_0</name>
                  <description>FSTAT[DFDIF] sets only if a double bit fault is detected during a valid flash read access from the platform flash controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDFD_1</name>
                  <description>FSTAT[DFDIF] sets during any valid flash read access from the platform flash controller. An interrupt request is generated if the DFDIE bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABTREQ</name>
              <description>Abort Request</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABTREQ_0</name>
                  <description>No request to abort a command write sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABTREQ_1</name>
                  <description>Request to abort a command write sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>FCCOB%s</name>
          <description>Flash Common Command Object Registers</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCOBn</name>
              <description>CCOBn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RF_FMCCFG</name>
      <description>RadioFlash</description>
      <groupName>RF_FMCCFG</groupName>
      <baseAddress>0x48982000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RFMCCFG</name>
          <description>Radio Flash Memory Controller Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFCF0</name>
              <description>Radio Flash Control Field 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCF1</name>
              <description>Radio Flash Control Field 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCF2</name>
              <description>Radio Flash Control Field 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCF3</name>
              <description>Radio Flash Control Field 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RF_CMC1</name>
      <description>RF_CMC</description>
      <groupName>RF_CMC1</groupName>
      <baseAddress>0x48983000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RADIO_LP</name>
          <description>Radio Low Power Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLEEP_EN</name>
              <description>Sleep Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_WKUP</name>
              <description>Bluetooth Wakeup</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK</name>
              <description>Clock Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CK_0</name>
                  <description>Normal configuration. When NBU CPU executes WFI and SLEEP_EN=1 (or if NBU CPU reset is asserted), and a sleep request from RFMC (LP_ENTER) NBU, MAN or WOR is asserted, the flash is put in low power, the sleep_rdy to RFMC asserts and the FRO will be disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CK_1</name>
                  <description>Configuration where NBU, FRO and flash are not used. When NBU CPU reset is asserted, or NBU CPU executes WFI and SLEEP_EN=1, the flash will be placed in low power, the FRO disabled, the sleep_rdy to RFMC will assert and the NBU CM3 and AHB clocks will be gated off. The RF_CMC and NBU CPU will be without a clock until the next reset, but low power requests (RFMC LP_ENTER, MAN or WOR) will by accepted by RFMC since RF_CMC's sleep_rdy output will remain asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CK_2</name>
                  <description>Configuration where NBU CPU is not used but FRO and flash can still be used. When NBU CPU reset is asserted, or NBU CPU executes WFI and SLEEP_EN=1, the clock to the NBU CPU will be gated. When RFMC (LP_ENTER), MAN or WOR request sleep, the flash is put in low power, the sleep_rdy to RFMC asserts and the FRO will be disabled as in configuration 00.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_LP</name>
          <description>SOC Low Power Control and Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUS_REQ</name>
              <description>Bus Access Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS_AWAKE</name>
              <description>Bus Awake</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_CTRL</name>
          <description>Interrupt Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDY_FLAG</name>
              <description>XTAL Ready Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RDY_IE</name>
              <description>XTAL Ready Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_RDY</name>
              <description>XTAL Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPM2_CFG</name>
          <description>TPM2 Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0_MUX_SEL</name>
              <description>Channel0 Input Mux Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0_MUX_SEL_0</name>
                  <description>TPM2_CH0 pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0_MUX_SEL_1</name>
                  <description>tof_timestamp_trig signal from radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1_MUX_SEL</name>
              <description>Channel1 Input Mux Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_0</name>
                  <description>TPM2_CH1 pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_1</name>
                  <description>dtest[0] signal from radio</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_2</name>
                  <description>dtest[1] signal from radio</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_3</name>
                  <description>dtest[2] signal from radio</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_4</name>
                  <description>dtest[3] signal from radio</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_5</name>
                  <description>dtest[4] signal from radio</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_6</name>
                  <description>dtest[5] signal from radio</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_7</name>
                  <description>dtest[6] signal from radio</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_8</name>
                  <description>dtest[7] signal from radio</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_9</name>
                  <description>dtest[8] signal from radio</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_10</name>
                  <description>dtest[9] signal from radio</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_11</name>
                  <description>dtest[10] signal from radio</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_12</name>
                  <description>dtest[11] signal from radio</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_13</name>
                  <description>dtest[12] signal from radio</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1_MUX_SEL_14</name>
                  <description>dtest[13] signal from radio</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Gate Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGC_0</name>
                  <description>TPM2 clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGC_1</name>
                  <description>TPM2 clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_MUX_SEL</name>
              <description>Clock Mux Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_MUX_SEL_0</name>
                  <description>No clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_MUX_SEL_1</name>
                  <description>Core Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_MUX_SEL_2</name>
                  <description>Radio Oscillator</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIO_TRIM</name>
          <description>Radio Trim Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x73</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BG_TRIM</name>
              <description>Bandgap Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BG_TRIM_0</name>
                  <description>787mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG_TRIM_1</name>
                  <description>794mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG_TRIM_2</name>
                  <description>800mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG_TRIM_3</name>
                  <description>806mV</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG_TRIM_4</name>
                  <description>812mV</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG_TRIM_5</name>
                  <description>819mV</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG_TRIM_6</name>
                  <description>825mV</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG_TRIM_7</name>
                  <description>831mV</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM3_PHANTOM</name>
              <description>CM3 Phantom</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM3_PHANTOM_2</name>
                  <description>CM3 disabled. The RF_CMC will hold the CM3 in reset</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM3_PHANTOM_7</name>
                  <description>CM3 enabled.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM_PWR</name>
          <description>RAM Power Control register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SD_EN</name>
              <description>Shut Down Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS_EN</name>
              <description>Deep Sleep Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
