nxp-mcuxpresso/mcux-soc-svd/KW45B41Z53/KW45B41Z53.xml
        <register>
          <name>RPA_CTRL</name>
          <description>RPA CONTROL</description>
          <alternateGroup>RPA_CTRL</alternateGroup>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RPA_VALID_ENTRY</name>
              <description>Here bits [7:0] corresponds to validity of 8th to 1st entry in RPA list respectively</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORE_RPA_FAIL</name>
              <description>no description available</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>link layer aborts the Rx process when LOCAL_RPA_FAIL_IRQ or PEER_RPA_FAIL_IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>link layer ignores LOCAL_RPA_FAIL_IRQ and PEER_RPA_FAIL_IRQ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IGNORE_DIRECT_FAIL</name>
              <description>no description available</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>link layer aborts the Rx process when DIRECT_ID_FAIL_IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>link layer ignores DIRECT_ID_FAIL_IRQ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADV_DIRECT_IND_SENT</name>
              <description>When set, it means the link layer is advertiser who has sent an ADV_DIRECT_IND</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPA_EN</name>
              <description>no description available</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>The RPA check is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>The RPA check is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADV_CHANNEL_EN</name>
              <description>no description available</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>The packet to be received is in Data Channel PDU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>The packet to be received is in Advertising Channel PDU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LENIENCY_MSB</name>
          <description>LENIENCY MSB</description>
          <alternateGroup>LENIENCY_MSB</alternateGroup>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LENIENCY_MSB</name>
              <description>Leniency MSB Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WL_CTRL</name>
          <description>WHITE LIST CONTROL</description>
          <alternateGroup>WL_CTRL</alternateGroup>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_EN</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>White list search is not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>White list search is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WL_SEL</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Select white list 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Select white list 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IGNORE_WL_FAIL</name>
              <description>no description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>link layer aborts the Rx process when WL_FAIL_IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>link layer ignores WL_FAIL_IRQ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DUAL_PAN_CTRL</name>
          <description>DUAL PAN CONTROL</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE_NETWORK</name>
              <description>Active Network Selector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_NETWORK_0</name>
                  <description>Select PAN0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_NETWORK_1</name>
                  <description>Select PAN1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUAL_PAN_AUTO</name>
              <description>Activates automatic Dual PAN operating mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURRENT_NETWORK</name>
              <description>Indicates which PAN is currently selected by hardware</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CURRENT_NETWORK_0</name>
                  <description>PAN0 is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_NETWORK_1</name>
                  <description>PAN1 is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUAL_PAN_DWELL</name>
              <description>Dual PAN Channel Frequency Dwell Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUAL_PAN_REMAIN</name>
              <description>Time Remaining before next PAN switch in auto Dual PAN mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE_PAN0</name>
              <description>PAN0 Mode Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_PAN0_0</name>
                  <description>PAN0 is in PAN mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_PAN0_1</name>
                  <description>PAN0 is in FAN mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE_PAN1</name>
              <description>PAN1 Mode Select</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_PAN1_0</name>
                  <description>PAN1 is in PAN mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_PAN1_1</name>
                  <description>PAN1 is in FAN mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DP_CHAN_OVRD_EN</name>
              <description>Dual PAN Channel Override Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DP_CHAN_OVRD_SEL</name>
              <description>Dual PAN Channel Override Selector</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PANCORDNTR0</name>
              <description>Device is a PAN Coordinator on PAN0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PANCORDNTR1</name>
              <description>Device is a PAN Coordinator on PAN1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECD_ON_PAN0</name>
              <description>Last Packet was Received on PAN0</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECD_ON_PAN1</name>
              <description>Last Packet was Received on PAN1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_PDU</name>
          <description>GTM MODE PDU</description>
          <alternateGroup>GTM_PDU</alternateGroup>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_PDU</name>
              <description>GTM MODE PDU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSHORTADDRS1</name>
          <description>MAC SHORT ADDRESS FOR PAN1</description>
          <alternateGroup>MACSHORTADDRS1</alternateGroup>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACPANID1</name>
              <description>MAC PAN ID for PAN1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACSHORTADDRS1</name>
              <description>MAC SHORT ADDRESS for PAN1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WL_VALID_ENTRY1</name>
          <description>VALID ENTRY OF WHITE LIST 1</description>
          <alternateGroup>WL_VALID_ENTRY1</alternateGroup>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_VALID_ENTRY1</name>
              <description>Here bits [31:0] corresponds to validity of 32th to 1st entry in white list 1 respectively</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIRECT_PEER_ADDR_LSB</name>
          <description>DIRECT_PEER_ADDR[31:0]</description>
          <alternateGroup>DIRECT_PEER_ADDR_LSB</alternateGroup>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIRECT_PEER_ADDR_LSB</name>
              <description>Lower 32 bit of 48-bit address of the direct peer device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_CFG</name>
          <description>GTM MODE CONFIGURATION</description>
          <alternateGroup>GTM_CFG</alternateGroup>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_PKT_NUM</name>
              <description>GTM MODE PACKET NUMBER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GTM_PDU_TYPE</name>
              <description>GTM MODE PDU TYPE SELECTION</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTM_PDU_TYPE0</name>
                  <description>PRBS9 Sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTM_PDU_TYPE1</name>
                  <description>Programmable 8-bit Pattern (from register GTM_PDU[7:0], reused from MACSHORTADDRS1[7:0])</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTM_PDU_TYPE2</name>
                  <description>PRBS-13 Sequence</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTM_PDU_TYPE3</name>
                  <description>PRBS-15 Sequence</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTM_PDU_TYPE4</name>
                  <description>Programmable 32-bit Pattern (from register GTM_PDU[31:0], reused from {MACSHORTADDRS1,MACPANID1})</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTM_PDU_TYPE5</name>
                  <description>Programmable packet from Packet RAM (in this case, PKT_LEN is ignored)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GTM_IPD_CHECK_DIS</name>
              <description>GTM MODE INTER-PACKET DURATION CHECK DISABLE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GTM_PKT_COUNT_CHECK_DIS</name>
              <description>GTM MODE PACKET NUMBER CHECK DISABLE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS1_LSB</name>
          <description>MAC LONG ADDRESS 1 LSB</description>
          <alternateGroup>MACLONGADDRS1_LSB</alternateGroup>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS1_LSB</name>
              <description>MAC LONG ADDRESS for PAN1 LSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIRECT_PEER_ADDR_MSB</name>
          <description>DIRECT_PEER_ADDR[47:32]</description>
          <alternateGroup>DIRECT_PEER_ADDR_MSB</alternateGroup>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIRECT_PEER_ADDR_MSB</name>
              <description>Higher 16 bit of 48-bit address of the direct peer device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRECT_PEER_ADDR_TYPE</name>
              <description>no description available</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Direct peer device address type is public.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Direct peer device address type is random.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_IPD</name>
          <description>GTM MODE INTER-PACKET DURATION</description>
          <alternateGroup>GTM_IPD</alternateGroup>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_IPD</name>
              <description>GTM MODE INTER-PACKET DURATION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS1_MSB</name>
          <description>MAC LONG ADDRESS 1 MSB</description>
          <alternateGroup>MACLONGADDRS1_MSB</alternateGroup>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS1_MSB</name>
              <description>MAC LONG ADDRESS for PAN1 MSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
