nxp-mcuxpresso/mcux-soc-svd/KW45B41Z53/KW45B41Z53.xml
        <register>
          <name>RCCAL_CTRL1</name>
          <description>RCCAL Control 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_CCODE_OVRD</name>
              <description>CBPF_CCODE Override Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPF_CCODE_OVRD_EN</name>
              <description>CBPF_CCODE Override Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCCAL_CODE_OVRD</name>
              <description>RCCAL_CODE Override Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCCAL_CODE_OVRD_EN</name>
              <description>RCCAL_CODE Override Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCCAL_SAMPLE_OVRD</name>
              <description>RCCAL_SAMPLE Override Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCCAL_CHARGE_OVRD</name>
              <description>RCCAL_CHARGE Override Value</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCCAL_DISCHARGE_OVRD</name>
              <description>RCCAL_DISCHARGE Override Value</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCCAL_CTRL_OVRD_EN</name>
              <description>RCCAL Control Signals Override Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCCAL_RES</name>
          <description>RCCAL Result</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4E10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RCCAL_CODE</name>
              <description>RCCAL_CODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CBPF_CCODE</name>
              <description>CBPF_CCODE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCCAL_CMPOUT</name>
              <description>RCCAL CMPOUT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CTRL0</name>
          <description>DCOC Control 0</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x332F56</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_SFII</name>
              <description>DCOC_SFII</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SFQQ</name>
              <description>DCOC_SFQQ</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SFIIP</name>
              <description>DCOC_SFIIP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SFQQP</name>
              <description>DCOC_SFQQP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SFIQ</name>
              <description>DCOC_SFIQ</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SFQI</name>
              <description>DCOC_SFQI</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_I_CAL_POL</name>
              <description>DCOC_I_CAL_POL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_Q_CAL_POL</name>
              <description>DCOC_Q_CAL_POL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_DAC_ORDER</name>
              <description>DCOC_DAC_ORDER</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOC_DAC_ORDER_0</name>
                  <description>DCOC I DAC is calibrated first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOC_DAC_ORDER_1</name>
                  <description>DCOC Q DAC is calibrated first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOC_PULSE_CAPCODE</name>
              <description>no description available</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CBPF_STL_TIME</name>
              <description>DCOC CBPF Settle Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SAR_STL_TIME</name>
              <description>DCOC CBPF Settle Time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CAL_USE_OFFSET</name>
              <description>Apply dcoc_i/qcbpf_offset during DCOC calibration.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOC_CAL_USE_OFFSET_0</name>
                  <description>Do not apply dcoc_i/qcbpf_offset during DCOC calibration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOC_CAL_USE_OFFSET_1</name>
                  <description>Apply dcoc_i/qcbpf_offset during DCOC calibration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOC_AVG_WIN</name>
              <description>DCOC Average Window Select</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOC_AVG_WIN_0</name>
                  <description>4-sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOC_AVG_WIN_1</name>
                  <description>8-sample</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOC_DIG_CORR_EN</name>
              <description>DCOC Digital Correction Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_DAC_OVRD_EN</name>
              <description>DCOC_DAC_OVRD_EN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_ADC_OFFSET_OVRD_EN</name>
              <description>DCOC_ADC_OFFSET_OVRD_EN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CBPF_SHORT_OVRD</name>
              <description>DCOC CBPF_SHORT Override Value</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CBPF_HIZ_OVRD</name>
              <description>DCOC CBPF_HIZ Override Value</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CBPF_HIZ_SHORT_OVRD_EN</name>
              <description>DCOC CBPF HIZ SHORT Override Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CTRL0_DRS</name>
          <description>DCOC Control 0 DRS</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x356</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_SFII</name>
              <description>DCOC_SFII</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SFQQ</name>
              <description>DCOC_SFQQ</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SFIIP</name>
              <description>DCOC_SFIIP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_SFQQP</name>
              <description>DCOC_SFQQP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CTRL1</name>
          <description>DCOC CONTROL 1</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_ILNA_OFFSET</name>
              <description>DCOC_ILNA_OFFSET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_QLNA_OFFSET</name>
              <description>DCOC_QLNA_OFFSET</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_ICBPF_OFFSET</name>
              <description>DCOC_ICBPF_OFFSET</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_QCBPF_OFFSET</name>
              <description>DCOC_QCBPF_OFFSET</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CTRL2</name>
          <description>DCOC CONTROL 2</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_DAC_OVRD_I</name>
              <description>DCOC_DAC_OVRD_I</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_DAC_OVRD_Q</name>
              <description>DCOC_DAC_OVRD_Q</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_ADC_OFFSET_OVRD_I</name>
              <description>DCOC_ADC_OFFSET_OVRD_I</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_ADC_OFFSET_OVRD_Q</name>
              <description>DCOC_ADC_OFFSET_OVRD_Q</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_STAT</name>
          <description>DCOC Status</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_CODE_DCOC_I</name>
              <description>CBPF_CODE_DCOC_I</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CBPF_CODE_DCOC_Q</name>
              <description>CBPF_CODE_DCOC_Q</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOC_ADC_OFFSET_I</name>
              <description>DCOC_ADC_OFFSET_I</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOC_ADC_OFFSET_Q</name>
              <description>DCOC_ADC_OFFSET_Q</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IQMC_CTRL0</name>
          <description>IQ Mismatch Control 0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4008000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IQMC_CAL_EN</name>
              <description>IQ Mismatch Cal Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IQMC_CAL_FREQ_SEL</name>
              <description>IQMC_CAL_FREQ_SEL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IQMC_CAL_FREQ_SEL_0</name>
                  <description>Reference clk divided by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IQMC_CAL_FREQ_SEL_1</name>
                  <description>Reference clk divided by 4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQMC_NUM_ITER</name>
              <description>IQ Mismatch Cal Num Iter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IQMC_DC_GAIN_ADJ</name>
              <description>Not currently used.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IQMC_CTRL1</name>
          <description>IQ Mismatch Control 1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IQMC_GAIN_ADJ</name>
              <description>IQ Mismatch Correction Gain Coeff</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IQMC_PHASE_ADJ</name>
              <description>IQ Mismatch Correction Phase Coeff</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_0_3</name>
          <description>Acquisition Filter Coeffs 0~3</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H0</name>
              <description>Acquisition Filter Coefficient 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H1</name>
              <description>Acquisition Filter Coefficient 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H2</name>
              <description>Acquisition Filter Coefficient 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3</name>
              <description>Acquisition Filter Coefficient 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_4_7</name>
          <description>Acquisition Filter Coeffs 4~7</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H4</name>
              <description>Acquisition Filter Coefficient 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H5</name>
              <description>Acquisition Filter Coefficient 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H6</name>
              <description>Acquisition Filter Coefficient 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H7</name>
              <description>Acquisition Filter Coefficient 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_FILT_8_9</name>
          <description>Acquisition Filter Coeffs 8~9</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H8</name>
              <description>Acquisition Filter Coefficient 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H9</name>
              <description>Acquisition Filter Coefficient 9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
