nxp-mcuxpresso/mcux-soc-svd/KW45B41Z53/KW45B41Z53.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XCVR_PLL_DIG</name>
      <description>XCVR_PLL_DIG</description>
      <groupName>XCVR_PLL_DIG</groupName>
      <baseAddress>0x48A07300</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HPM_BUMP</name>
          <description>PLL HPM Analog Bump Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x441012</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_VCM_TX</name>
              <description>a_ip_2p4ghz_reg_dac_trim_vcm_dig[2:0] during Transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_VCM_TX_0</name>
                  <description>0.120 (0.122)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_1</name>
                  <description>0.153 (0.189)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_2</name>
                  <description>0.182 (0.247)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_3</name>
                  <description>0.209 (0.300)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_4</name>
                  <description>0.234 (0.348)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_5</name>
                  <description>0.258 (0.393)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_6</name>
                  <description>0.279 (0.434)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_7</name>
                  <description>0.318 (0.509)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_VCM_CAL</name>
              <description>a_ip_2p4ghz_reg_dac_trim_vcm_dig[2:0] during Calibration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_0</name>
                  <description>0.120 (0.122)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_1</name>
                  <description>0.153 (0.189)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_2</name>
                  <description>0.182 (0.247)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_3</name>
                  <description>0.209 (0.300)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_4</name>
                  <description>0.234 (0.348)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_5</name>
                  <description>0.258 (0.393)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_6</name>
                  <description>0.279 (0.434)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_7</name>
                  <description>0.318 (0.509)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_FDB_RES_TX</name>
              <description>a_ip_2p4ghz_reg_dac_trim_rfbk_dig[1:0] during Transmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_FDB_RES_TX_0</name>
                  <description>38.0k (1.0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_FDB_RES_TX_1</name>
                  <description>76.0k (0.5)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_FDB_RES_TX_2</name>
                  <description>32.5k (1.14)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_FDB_RES_TX_3</name>
                  <description>25.3k (1.4)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_FDB_RES_CAL</name>
              <description>a_ip_2p4ghz_reg_dac_trim_rfbk_dig[1:0] during Calibration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_FDB_RES_CAL_0</name>
                  <description>38.0k (1.0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_FDB_RES_CAL_1</name>
                  <description>76.0k (0.5)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_FDB_RES_CAL_2</name>
                  <description>32.5k (1.14)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_FDB_RES_CAL_3</name>
                  <description>25.3k (1.4)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_TRIM_KVM_TX</name>
              <description>reg_vco_trim_kvm_dig[2:0] for transmitt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_TX_0</name>
                  <description>10MHz/V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_TX_4</name>
                  <description>20MHz/V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_TX_6</name>
                  <description>30MHz/V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_TX_7</name>
                  <description>40MHz/V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_TRIM_KVM_CAL</name>
              <description>reg_vco_trim_kvm_dig[2:0] for calibration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_CAL_0</name>
                  <description>10MHz/V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_CAL_4</name>
                  <description>20MHz/V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_CAL_6</name>
                  <description>30MHz/V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_CAL_7</name>
                  <description>40MHz/V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD_CTRL</name>
          <description>PLL Modulation Control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODULATION_WORD_MANUAL</name>
              <description>Manual Modulation Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD_DISABLE</name>
              <description>Disable Modulation Word</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_MOD_MANUAL</name>
              <description>Manual HPM Modulation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_MOD_DISABLE</name>
              <description>Disable HPM Modulation</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_SDM_OUT_MANUAL</name>
              <description>Manual HPM SDM out</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_SDM_OUT_DISABLE</name>
              <description>Disable HPM SDM out</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHAN_MAP</name>
          <description>PLL Channel Mapping</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_NUM_OVRD</name>
              <description>Channel Selection Override</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BAND_SELECT</name>
              <description>Channel Mapping Band Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BAND_SELECT_0</name>
                  <description>Bluetooth Low Energy</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAND_SELECT_1</name>
                  <description>Bluetooth Low Energy in MBAN</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAND_SELECT_2</name>
                  <description>Bluetooth Low Energy overlap MBAN</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAND_SELECT_6</name>
                  <description>Radio Channels 0-127 selectable</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAND_SELECT_7</name>
                  <description>Radio Channels 0-127 selectable</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BMR</name>
              <description>Bluetooth Low Energy MBAN Channel Remap</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BMR_0</name>
                  <description>Bluetooth Low Energy channel 39 is mapped to Bluetooth Low Energy channel 39, 2.480 GHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMR_1</name>
                  <description>Bluetooth Low Energy channel 39 is mapped to MBAN channel 39, 2.399 GHz</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOP_TBL_CFG_OVRD</name>
              <description>Hop Table Configuration Override</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOP_TBL_CFG_OVRD_0</name>
                  <description>CHANNEL_NUM_OVRD[6:0] is used as the mapped channel number. CHANNEL_NUM_OVRD[15:7] is unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOP_TBL_CFG_OVRD_1</name>
                  <description>CHANNEL_NUM_OVRD[6:0] is used as the mapped channel number. CHANNEL_NUM_OVRD[15:7] is unused.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOP_TBL_CFG_OVRD_2</name>
                  <description>CHANNEL_NUM_OVRD[15:7] is signed Numerator offset to CHANNEL_NUM_OVRD[6:0] mapped channel number</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOP_TBL_CFG_OVRD_3</name>
                  <description>CHANNEL_NUM_OVRD[15:1] is selected as the signed Numerator, CHANNEL_NUM_OVRD[0] is integer selection</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOP_TBL_CFG_OVRD_EN</name>
              <description>Hop Table Configuration Override Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHAN_MAP_EXT</name>
          <description>PLL Channel Mapping Extended</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM_OFFSET</name>
              <description>Numerator Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_TGT_OFFSET</name>
              <description>Coarse Tune Target Frequency Offset</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
