nxp-mcuxpresso/mcux-soc-svd/KW45B41Z53/KW45B41Z53.xml
        <register>
          <name>OVRD0</name>
          <description>TSM OVERRIDE REGISTER 0</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_RF_ACTIVE_OVRD_EN</name>
              <description>Override control for TSM_RF_ACTIVE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_RF_ACTIVE_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_RF_ACTIVE_OVRD_EN_1</name>
                  <description>Use the state of TSM_RF_ACTIVE_OVRD to override the signal &quot;tsm_rf_active&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_RF_ACTIVE_OVRD</name>
              <description>Override value for tsm_rf_active</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_RF_STATUS_OVRD_EN</name>
              <description>Override control for TSM_RF_STATUS_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_RF_STATUS_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_RF_STATUS_OVRD_EN_1</name>
                  <description>Use the state of TSM_RF_STATUS_OVRD to override the signal &quot;tsm_rf_status&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_RF_STATUS_OVRD</name>
              <description>Override value for TSM_RF_STATUS</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_RF_PRIORITY_OVRD_EN</name>
              <description>Override control for TSM_RF_PRIORITY_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_RF_PRIORITY_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_RF_PRIORITY_OVRD_EN_1</name>
                  <description>Use the state of TSM_RF_PRIORITY_OVRD to override the signal &quot;tsm_rf_priority&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_RF_PRIORITY_OVRD</name>
              <description>Override value for tsm_rf_priority</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_IRQ0_START_TRIG_OVRD_EN</name>
              <description>Override control for TSM_IRQ0_START_TRIG_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_IRQ0_START_TRIG_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_IRQ0_START_TRIG_OVRD_EN_1</name>
                  <description>Use the state of TSM_IRQ0_START_TRIG_OVRD to override the signal &quot;tsm_irq0_start_trig&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_IRQ0_START_TRIG_OVRD</name>
              <description>Override value for TSM_IRQ0_START_TRIG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_IRQ1_STOP_TRIG_OVRD_EN</name>
              <description>Override control for TSM_IRQ1_STOP_TRIG</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_IRQ1_STOP_TRIG_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_IRQ1_STOP_TRIG_OVRD_EN_1</name>
                  <description>Use the state of TSM_IRQ1_STOP_TRIG_OVRD to override the signal &quot;tsm_irq1_stop_trig&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_IRQ1_STOP_TRIG_OVRD</name>
              <description>Override value for TSM_IRQ1_STOP_TRIG</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_GAIN_CFG_EN_OVRD_EN</name>
              <description>Override control for DCOC_GAIN_CFG_EN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOC_GAIN_CFG_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOC_GAIN_CFG_EN_OVRD_EN_1</name>
                  <description>Use the state of DCOC_GAIN_CFG_EN_OVRD to override the signal &quot;dcoc_gain_cfg_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOC_GAIN_CFG_EN_OVRD</name>
              <description>Override value for DCOC_GAIN_CFG_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_CAL_EN_OVRD_EN</name>
              <description>Override control for LDO_CAL_EN_</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_CAL_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_CAL_EN_OVRD_EN_1</name>
                  <description>Use the state of LDO_CAL_EN_OVRD to override the signal &quot;ldo_cal_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_CAL_EN_OVRD</name>
              <description>Override value for LDO_CAL_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIG_EN_OVRD_EN</name>
              <description>Override control for PLL_DIG_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_DIG_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIG_EN_OVRD_EN_1</name>
                  <description>Use the state of PLL_DIG_EN_OVRD to override the signal &quot;pll_dig_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_DIG_EN_OVRD</name>
              <description>Override value for PLL_DIG_EN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGMA_DELTA_EN_OVRD_EN</name>
              <description>Override control for SIGMA_DELTA_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIGMA_DELTA_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIGMA_DELTA_EN_OVRD_EN_1</name>
                  <description>Use the state of SIGMA_DELTA_EN_OVRD to override the signal &quot;sigma_delta_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIGMA_DELTA_EN_OVRD</name>
              <description>Override value for SIGMA_DELTA_EN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CAL_EN_OVRD_EN</name>
              <description>Override control for DCOC_CAL_EN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOC_CAL_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOC_CAL_EN_OVRD_EN_1</name>
                  <description>Use the state of DCOC_CAL_EN_OVRD to override the signal &quot;dcoc_cal_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOC_CAL_EN_OVRD</name>
              <description>Override value for DCOC_CAL_EN</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DIG_EN_OVRD_EN</name>
              <description>Override control for TX_DIG_EN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX_DIG_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_DIG_EN_OVRD_EN_1</name>
                  <description>Use the state of TX_DIG_EN_OVRD to override the signal &quot;tx_dig_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_DIG_EN_OVRD</name>
              <description>Override value for TX_DIG_EN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_TARG_LD_EN_OVRD_EN</name>
              <description>Override control for FREQ_TARG_LD_EN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREQ_TARG_LD_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ_TARG_LD_EN_OVRD_EN_1</name>
                  <description>Use the state of FREQ_TARG_LD_EN_OVRD to override the signal &quot;freq_targ_ld_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQ_TARG_LD_EN_OVRD</name>
              <description>Override value for FREQ_TARG_LD_EN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_INIT_EN_OVRD_EN</name>
              <description>Override control for RX_INIT_EN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_INIT_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_INIT_EN_OVRD_EN_1</name>
                  <description>Use the state of RX_INIT_EN_OVRD to override the signal &quot;rx_init_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_INIT_EN_OVRD</name>
              <description>Override value for RX_INIT_EN</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DIG_EN_OVRD_EN</name>
              <description>Override control for RX_DIG_EN</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_DIG_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DIG_EN_OVRD_EN_1</name>
                  <description>Use the state of RX_DIG_EN_OVRD to override the signal &quot;rx_dig_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_DIG_EN_OVRD</name>
              <description>Override value for RX_DIG_EN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY_EN_OVRD_EN</name>
              <description>Override control for RX_PHY_EN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_PHY_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_PHY_EN_OVRD_EN_1</name>
                  <description>Use the state of RX_PHY_EN_OVRD to override the signal &quot;rx_phy_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_PHY_EN_OVRD</name>
              <description>Override value for RX_PHY_EN</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_CAL_OVRD_EN</name>
              <description>Override control for SEQ_BG_PUP_IBG_CAL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_CAL_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_CAL_OVRD_EN_1</name>
                  <description>Use the state of SEQ_BG_PUP_IBG_CAL_OVRD to override the signal &quot;seq_bg_pup_ibg_cal&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_CAL_OVRD</name>
              <description>Override value for SEQ_BG_PUP_IBG_CAL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
